// 자동 생성 파일: tools/make_font.py가 만든다. 직접 고치지 말 것.

#ifndef HS_FONT_H
#define HS_FONT_H

#include "bn_sprite_font.h"
#include "bn_utf8_characters_map.h"
#include "bn_sprite_items_hs_font.h"

namespace hs
{

constexpr bn::utf8_character font_utf8_characters[] = {
    "↓", "▼", "가", "간", "값", "강", "검", "게", "겠", "계", "고", "공", "관", "괴", "구", "권",
    "금", "기", "까", "꺼", "께", "꽃", "끼", "난", "낡", "내", "녹", "높", "는", "다", "단", "대",
    "던", "도", "돈", "돌", "되", "드", "득", "든", "땅", "때", "떻", "라", "란", "랜", "려", "령",
    "로", "료", "루", "률", "를", "름", "리", "린", "만", "매", "면", "명", "모", "문", "물", "미",
    "바", "반", "방", "버", "보", "부", "불", "비", "빛", "빵", "뼈", "상", "서", "설", "성", "소",
    "수", "스", "슨", "시", "실", "쓴", "쓸", "아", "악", "안", "알", "어", "었", "예", "와", "완",
    "왕", "우", "웃", "워", "원", "월", "위", "으", "은", "을", "음", "의", "이", "일", "있", "자",
    "잡", "장", "재", "전", "점", "졌", "조", "줬", "지", "질", "집", "착", "찼", "창", "철", "초",
    "최", "켰", "코", "타", "탭", "템", "투", "파", "판", "팔", "패", "프", "필", "하", "한", "함",
    "합", "혼", "화",
};

constexpr int8_t font_character_widths[] = {
    6, 4, 7, 8, 8, 7, 8, 4, 5, 5, 7, 7, 4, 7, 4, 7, 7, 4, 7, 7, 7, 7, 7, 7,
    7, 7, 4, 4, 6, 7, 6, 7, 8, 7, 7, 7, 7, 7, 7, 7, 7, 5, 7, 7, 7, 8, 7, 7,
    7, 8, 7, 7, 7, 7, 7, 8, 7, 7, 7, 5, 7, 5, 4, 7, 4, 7, 7, 7, 7, 7, 6, 7,
    7, 3, 4, 6, 3, 8, 7, 7, 7, 7, 6, 7, 6, 7, 7, 8, 7, 7, 7, 6, 3, 6, 8, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13,
    13, 13,
};

constexpr bn::span<const bn::utf8_character> font_utf8_characters_span(font_utf8_characters);

constexpr auto font_utf8_characters_map = bn::utf8_characters_map<font_utf8_characters_span>();

constexpr bn::sprite_font font(
        bn::sprite_items::hs_font, font_utf8_characters_map.reference(), font_character_widths);

}

#endif
